# PyCity Schools Analysis

Your report must include a written description of at least two observable trends based on the data:

- Your analysis here

---

In [1]:
# Import Dependencies
import pandas as pd

In [2]:
# Set Paths
school_data_csv = "Resources/schools_complete.csv"
student_data_csv = "Resources/students_complete.csv"

In [3]:
# Read School File as Dataframe
school_df = pd.read_csv(school_data_csv)
school_df.head(3)

   School ID           school_name      type  size   budget
0          0     Huang High School  District  2917  1910635
1          1  Figueroa High School  District  2949  1884411
2          2   Shelton High School   Charter  1761  1056600

In [4]:
# Read Student File as Dataframe
student_df = pd.read_csv(student_data_csv)
student_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60

In [5]:
# Combine Dataframes  
combined_school_df = pd.merge(student_df, school_df, how="left", on=["school_name"])
combined_school_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635

## District Summary

Perform the necessary calculations and then create a high-level snapshot of the district's key metrics in a DataFrame.

Include the following:

- Total number of unique schools

- Total students

- Total budget

- Average math score

- Average reading score

- % passing math (the percentage of students who passed math)

- % passing reading (the percentage of students who passed reading)

- % overall passing (the percentage of students who passed math AND reading)

------

##### Total Number of Unique Schools

In [6]:
# Calculate the total number of unique schools
school_count = len(combined_school_df["school_name"].unique())
school_count

15

##### Total Students

In [7]:
# Calculate the total number of unique students
students_count = len(combined_school_df["student_name"])
students_count

39170

##### Total Budget

In [8]:
total_budget = school_df["budget"].sum()
total_budget

24649428

##### Average Math Score

In [9]:
# Calculate the average (mean) math score
average_math_score = combined_school_df["math_score"].mean()
average_math_score

78.98537145774827

##### Average Reading Score

In [10]:
# Calculate the average (mean) reading score
average_reading_score = combined_school_df["reading_score"].mean()
average_reading_score

81.87784018381414

##### % Passing Math

In [11]:
# Calculate the number of students who passed math (math scores greather than or equal to 70)
passing_math_count = combined_school_df[(combined_school_df["math_score"] >= 70)].count()["student_name"]
passing_math_count

29370

In [12]:
# Calculate the percentage of students who passed math (math scores greather than or equal to 70)
passing_math_percentage = passing_math_count / float(students_count) * 100
passing_math_percentage

74.9808526933878

##### % Passing Reading

In [13]:
# Calculate the number of students who passed reading (reading scores greather than or equal to 70)
passing_reading_count = combined_school_df[(combined_school_df["reading_score"] >= 70)].count()["student_name"]
passing_reading_count

33610

In [14]:
 # Calculate the percentage of students who passed reading (reading scores greather than or equal to 70)
passing_reading_percentage = passing_reading_count / float(students_count) * 100
passing_reading_percentage

85.80546336482001

##### % Overall Passing

In [15]:
# Calculate the number of students that passed math and reading
passing_math_reading_count = combined_school_df[
    (combined_school_df["math_score"] >= 70) & (combined_school_df["reading_score"] >= 70)
].count()["student_name"]
passing_math_reading_count

25528

In [16]:
# Calculate the percentage of students that passed math and reading
overall_passing_rate = passing_math_reading_count /  float(students_count) * 100
overall_passing_rate

65.17232575950983

##### High-Level Snapshot of the District's Key Metrics

In [17]:
# Create a high-level snapshot of the district's key metrics in a DataFrame
district_summary_df = pd.DataFrame ([
    {"District Total Schools":school_count,
     "District Total Students":students_count,
     "District Total Budget":total_budget,
     "District Average Math Score":average_math_score, 
     "District Avarage Reading Score":average_reading_score, 
     "District Percent Passing Math":passing_math_percentage, 
     "District Percent Passing Reading":passing_reading_percentage, 
     "District Percent Passing Overall":overall_passing_rate}
])
district_summary_df.head()

,District Total Schools,District Total Students,District Total Budget,District Average Math Score,District Avarage Reading Score,District Percent Passing Math,District Percent Passing Reading,District Percent Passing Overall
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [18]:
# Formatting
district_summary_df["District Total Students"] = district_summary_df["District Total Students"].map("{:,}".format)
district_summary_df["District Total Budget"] = district_summary_df["District Total Budget"].map("${:,.2f}".format)
district_summary_df["District Average Math Score"] = district_summary_df["District Average Math Score"].map("%{:.2f}".format)
district_summary_df["District Avarage Reading Score"] = district_summary_df["District Avarage Reading Score"].map("%{:.2f}".format)
district_summary_df["District Percent Passing Math"] = district_summary_df["District Percent Passing Math"].map("%{:.2f}".format)
district_summary_df["District Percent Passing Reading"] = district_summary_df["District Percent Passing Reading"].map("%{:.2f}".format)
district_summary_df["District Percent Passing Overall"] = district_summary_df["District Percent Passing Overall"].map("%{:.2f}".format)

In [19]:
# Display the DataFrame
district_summary_df

,District Total Schools,District Total Students,District Total Budget,District Average Math Score,District Avarage Reading Score,District Percent Passing Math,District Percent Passing Reading,District Percent Passing Overall
0,15,"39,170","$24,649,428.00",%78.99,%81.88,%74.98,%85.81,%65.17

## School Summary

Perform the necessary calculations and then create a DataFrame that summarizes key metrics about each school.

Include the following:

- School name

- School type

- Total students

- Total school budget

- Per student budget

- Average math score

- Average reading score

- % passing math (the percentage of students who passed math)

- % passing reading (the percentage of students who passed reading)

- % overall passing (the percentage of students who passed math AND reading)

------

### School Names

In [20]:
# Create list of school names
school_names = combined_school_df["school_name"].unique()
school_names

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [21]:
#Create school summary dataframe
school_summary_df = pd.DataFrame({
    "school_name":['Huang High School','Figueroa High School','Shelton High School','Hernandez High School','Griffin High School',
                      'Wilson High School','Cabrera High School','Bailey High School','Holden High School','Pena High School',
                      'Wright High School','Rodriguez High School','Johnson High School','Ford High School','Thomas High School']
})
school_summary_df.head(3)

            school_name
0     Huang High School
1  Figueroa High School
2   Shelton High School

### School Types

In [22]:
# Select all of the school types
school_types_df = school_df[["school_name","type"]]
school_types_df.head(3)

            school_name      type
0     Huang High School  District
1  Figueroa High School  District
2   Shelton High School   Charter

In [23]:
#Add school types to school summary dataframe
school_summary_df = pd.merge(school_summary_df, school_types_df, how="left", on=["school_name"])
school_summary_df.head()

             school_name      type
0      Huang High School  District
1   Figueroa High School  District
2    Shelton High School   Charter
3  Hernandez High School  District
4    Griffin High School   Charter

### Total Students

In [24]:
# Calculate the total student count per school
per_school_counts = combined_school_df["school_name"].value_counts()
per_school_counts.head(3)

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Name: school_name, dtype: int64

In [25]:
#Total student count dataframe
per_school_counts_df = pd.DataFrame ([
    {"school_name":"Bailey High School", "total_students":4976},
    {"school_name":"Johnson High School", "total_students":4761},
    {"school_name":"Hernandez High School", "total_students":4635},
    {"school_name":"Rodriguez High School", "total_students":3999},
    {"school_name":"Figueroa High School", "total_students":2949},
    {"school_name":"Huang High School", "total_students":2917},
    {"school_name":"Ford High School", "total_students":2739},
    {"school_name":"Wilson High School", "total_students":2283},
    {"school_name":"Cabrera High School", "total_students":1858},
    {"school_name":"Wright High School", "total_students":1800},
    {"school_name":"Shelton High School", "total_students":1761},
    {"school_name":"Thomas High School", "total_students":1635},
    {"school_name":"Griffin High School", "total_students":1468},
    {"school_name":"Pena High School", "total_students":962},
    {"school_name":"Holden High School", "total_students":427}  
])

per_school_counts_df.head(3)

             school_name  total_students
0     Bailey High School            4976
1    Johnson High School            4761
2  Hernandez High School            4635

In [26]:
#Add total students to school summary dataframe
school_summary_df = pd.merge(school_summary_df, per_school_counts_df, how="left", on=["school_name"])
school_summary_df.head(3)

            school_name      type  total_students
0     Huang High School  District            2917
1  Figueroa High School  District            2949
2   Shelton High School   Charter            1761

### School Budget

In [27]:
# Calculate the total school budget
per_school_budget_df = school_df[["school_name","budget"]]
per_school_budget_df.head(3)

            school_name   budget
0     Huang High School  1910635
1  Figueroa High School  1884411
2   Shelton High School  1056600

In [28]:
#Add budget to school summary dataframe
school_summary_df = pd.merge(school_summary_df, per_school_budget_df, how="left", on=["school_name"])
school_summary_df.head()

             school_name      type  total_students   budget
0      Huang High School  District            2917  1910635
1   Figueroa High School  District            2949  1884411
2    Shelton High School   Charter            1761  1056600
3  Hernandez High School  District            4635  3022020
4    Griffin High School   Charter            1468   917500

### School Budget Per Capita

In [29]:
# Calculate the per capita spending per school
per_school_capita = school_summary_df["budget"] / school_summary_df["total_students"]
per_school_capita.head(3)

0    655.0
1    639.0
2    600.0
dtype: float64

In [30]:
# Add the per capita spending per school to summary dataframe
school_summary_df["budget_per_capita"] = per_school_capita
school_summary_df.head(3)

            school_name      type  total_students   budget  budget_per_capita
0     Huang High School  District            2917  1910635              655.0
1  Figueroa High School  District            2949  1884411              639.0
2   Shelton High School   Charter            1761  1056600              600.0

## Average Test Scores

In [31]:
#Create dataframe of scores from different students
per_school_test_df = combined_school_df[["school_name","reading_score","math_score"]]
per_school_test_df.head(3)

         school_name  reading_score  math_score
0  Huang High School             66          79
1  Huang High School             94          61
2  Huang High School             90          60

In [32]:
#Group the test data frame by school
grouped_test_df=per_school_test_df.groupby(["school_name"])

### Average Math Score

In [33]:
# Calculate the average math test scores per school
per_school_math_df = grouped_test_df[["math_score"]].mean()
per_school_math_df = per_school_math_df.rename(columns = {"math_score":"avg_math_score"})
per_school_math_df.head(3)

                      avg_math_score
school_name
Bailey High School         77.048432
Cabrera High School        83.061895
Figueroa High School       76.711767

In [34]:
#Add average math scores to school summary dataframe
school_summary_df = pd.merge(school_summary_df, per_school_math_df, how="left", on=["school_name"])
school_summary_df.head()

,school_name,type,total_students,budget,budget_per_capita,avg_math_score
0,Huang High School,District,2917,1910635,655.0,76.629414
1,Figueroa High School,District,2949,1884411,639.0,76.711767
2,Shelton High School,Charter,1761,1056600,600.0,83.359455
3,Hernandez High School,District,4635,3022020,652.0,77.289752
4,Griffin High School,Charter,1468,917500,625.0,83.351499

### Average Reading Scores

In [35]:
# Calculate the average reading test scores per school
per_school_reading_df = grouped_test_df[["reading_score"]].mean()
per_school_reading_df = per_school_reading_df.rename(columns = {"reading_score":"avg_reading_score"})
per_school_reading_df.head(3)

                      avg_reading_score
school_name
Bailey High School            81.033963
Cabrera High School           83.975780
Figueroa High School          81.158020

In [36]:
#Add average reading scores to school summary dataframe
school_summary_df = pd.merge(school_summary_df, per_school_reading_df, how="left", on=["school_name"])
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724

### Number Passing Math

In [37]:
#Get dataframe of math scores
per_school_mathtest_df=per_school_test_df[["school_name","math_score"]]
per_school_mathtest_df.head(3)

         school_name  math_score
0  Huang High School          79
1  Huang High School          61
2  Huang High School          60

In [38]:
#Creating dataframe of those who passed math
students_passing_math_df = per_school_mathtest_df[(per_school_mathtest_df["math_score"] >= 70)]
students_passing_math_df.head(3)

         school_name  math_score
0  Huang High School          79
4  Huang High School          84
5  Huang High School          94

In [39]:
# Calculate the number of students per school with math scores of 70 or higher
school_students_passing_math_df = students_passing_math_df.groupby(["school_name"]).count()
school_students_passing_math_df = school_students_passing_math_df.rename(columns = {"math_score":"students_passing_math"})
school_students_passing_math_df.head(3)

                      students_passing_math
school_name
Bailey High School                     3318
Cabrera High School                    1749
Figueroa High School                   1946

In [40]:
#Add students passing math to school summary dataframe
school_summary_df = pd.merge(school_summary_df, school_students_passing_math_df, how="left", on=["school_name"])
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score,students_passing_math
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653

### Number Passing Reading

In [41]:
#Get dataframe of reading scores
per_school_readtest_df=per_school_test_df[["school_name","reading_score"]]
per_school_readtest_df.head(3)

         school_name  reading_score
0  Huang High School             66
1  Huang High School             94
2  Huang High School             90

In [42]:
#Creating dataframe of those who passed reading
students_passing_reading_df = per_school_readtest_df[(per_school_readtest_df["reading_score"] >= 70)]
students_passing_reading_df.head(3)

         school_name  reading_score
1  Huang High School             94
2  Huang High School             90
4  Huang High School             97

In [43]:
# Calculate the number of students per school with reading scores of 70 or higher
school_students_passing_reading_df = students_passing_reading_df.groupby(["school_name"]).count()
school_students_passing_reading_df = school_students_passing_reading_df.rename(columns = {"reading_score":"students_passing_reading"})
school_students_passing_reading_df.head(3)

                      students_passing_reading
school_name
Bailey High School                        4077
Cabrera High School                       1803
Figueroa High School                      2381

In [44]:
#Add students passing reading to school summary dataframe
school_summary_df = pd.merge(school_summary_df, school_students_passing_reading_df, how="left", on=["school_name"])
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score,students_passing_math,students_passing_reading
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688

### Number Overall Passing

In [45]:
#Creating dataframe with overall passers
students_passing_math_and_reading_df = combined_school_df[
    (combined_school_df["math_score"] >= 70) & (combined_school_df["reading_score"] >= 70)
]
students_passing_math_and_reading_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [46]:
#Group dataframe by school
students_passing_math_and_reading_df = students_passing_math_and_reading_df.groupby(["school_name"]).count() ["student_name"]
students_passing_math_and_reading_df = pd.DataFrame(students_passing_math_and_reading_df)
students_passing_math_and_reading_df = students_passing_math_and_reading_df.rename(columns = {"student_name":"students_passing_both"})
students_passing_math_and_reading_df.head(3)

                      students_passing_both
school_name
Bailey High School                     2719
Cabrera High School                    1697
Figueroa High School                   1569

In [47]:
#Add students passing both to school summary dataframe
school_summary_df = pd.merge(school_summary_df, students_passing_math_and_reading_df, how="left", on=["school_name"])
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score,students_passing_math,students_passing_reading,students_passing_both
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583

### Percents Passing Math

In [48]:
# Use the provided code to calculate the passing rates
per_school_passing_math = school_summary_df["students_passing_math"] / school_summary_df["total_students"] * 100
per_school_passing_math.head(3)

0    65.683922
1    65.988471
2    93.867121
dtype: float64

In [49]:
# Add Passing rates to school summary dataframe
school_summary_df["% Passing Math"]=per_school_passing_math
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score,students_passing_math,students_passing_reading,students_passing_both,% Passing Math
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121

### Percents Passing Reading

In [50]:
# Use the provided code to calculate the passing rates
per_school_passing_reading = school_summary_df["students_passing_reading"] / school_summary_df["total_students"] * 100
per_school_passing_reading.head(3)

0    81.316421
1    80.739234
2    95.854628
dtype: float64

In [51]:
# Add Passing rates to school summary dataframe
school_summary_df["% Passing Reading"] = per_school_passing_reading
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score,students_passing_math,students_passing_reading,students_passing_both,% Passing Math,% Passing Reading
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628

### Percents Passing Both

In [52]:
# Use the provided code to calculate the passing rates
overall_passing_rate = school_summary_df["students_passing_both"] / school_summary_df["total_students"] * 100
overall_passing_rate.head(3)

0    53.513884
1    53.204476
2    89.892107
dtype: float64

In [53]:
# Add Passing rates to school summary dataframe
school_summary_df["% Passing Both"] = overall_passing_rate
school_summary_df.head(3)

,school_name,type,total_students,budget,budget_per_capita,avg_math_score,avg_reading_score,students_passing_math,students_passing_reading,students_passing_both,% Passing Math,% Passing Reading,% Passing Both
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107

### Summary Dataframe

In [54]:
#Retitle Columns in Summary Dataframe
# Create a DataFrame called `per_school_summary` with columns for the calculations above.
per_school_summary_df=school_summary_df.rename(columns = {"school_name":"School Name",
                                                      "type":"School Type",
                                                      "total_students":"Total Students",
                                                      "budget":"School Budget",
                                                      "budget_per_capita":"Budget Per Student",
                                                      "avg_math_score":"Average Math Score",
                                                      "avg_reading_score":"Average Reading Score",
                                                      "students_passing_math":"Students Passing Math",
                                                      "students_passing_reading":"Students Passing Reading",
                                                      "students_passing_both":"Students Passing Both"
})
per_school_summary_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107

In [58]:
#Copy without formatting for future math
per_school_sum_B4_df=per_school_summary_df.copy()

In [59]:
# Formatting
per_school_summary_df["Total Students"] = per_school_summary_df["Total Students"].map("{:,}".format)
per_school_summary_df["School Budget"] = per_school_summary_df["School Budget"].map("${:,.2f}".format)
per_school_summary_df["Budget Per Student"] = per_school_summary_df["Budget Per Student"].map("${:,.2f}".format)
per_school_summary_df["Average Math Score"] = per_school_summary_df["Average Math Score"].map("%{:.2f}".format)
per_school_summary_df["Average Reading Score"] = per_school_summary_df["Average Reading Score"].map("%{:.2f}".format)
per_school_summary_df["Students Passing Math"] = per_school_summary_df["Students Passing Math"].map("{:,}".format)
per_school_summary_df["Students Passing Reading"] = per_school_summary_df["Students Passing Reading"].map("{:,}".format)
per_school_summary_df["Students Passing Both"] = per_school_summary_df["Students Passing Both"].map("{:,}".format)
per_school_summary_df["% Passing Math"] = per_school_summary_df["% Passing Math"].map("%{:.2f}".format)
per_school_summary_df["% Passing Reading"] = per_school_summary_df["% Passing Reading"].map("%{:.2f}".format)
per_school_summary_df["% Passing Both"] = per_school_summary_df["% Passing Both"].map("%{:.2f}".format)
per_school_summary_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
0,Huang High School,District,"2,917","$1,910,635.00",$655.00,%76.63,%81.18,"1,916","2,372","1,561",%65.68,%81.32,%53.51
1,Figueroa High School,District,"2,949","$1,884,411.00",$639.00,%76.71,%81.16,"1,946","2,381","1,569",%65.99,%80.74,%53.20
2,Shelton High School,Charter,"1,761","$1,056,600.00",$600.00,%83.36,%83.73,"1,653","1,688","1,583",%93.87,%95.85,%89.89

## Highest-Performing Schools (by % Overall Passing)

In [60]:
# Sort the schools by `% Overall Passing` in descending order and display the top 5 rows.
top_schools_df = per_school_summary_df.sort_values("% Passing Both", ascending = False)
top_schools_df.head(5)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
6,Cabrera High School,Charter,"1,858","$1,081,356.00",$582.00,%83.06,%83.98,"1,749","1,803","1,697",%94.13,%97.04,%91.33
14,Thomas High School,Charter,"1,635","$1,043,130.00",$638.00,%83.42,%83.85,"1,525","1,591","1,487",%93.27,%97.31,%90.95
4,Griffin High School,Charter,"1,468","$917,500.00",$625.00,%83.35,%83.82,"1,371","1,426","1,330",%93.39,%97.14,%90.60
5,Wilson High School,Charter,"2,283","$1,319,574.00",$578.00,%83.27,%83.99,"2,143","2,204","2,068",%93.87,%96.54,%90.58
9,Pena High School,Charter,962,"$585,858.00",$609.00,%83.84,%84.04,910,923,871,%94.59,%95.95,%90.54

## Bottom Performing Schools (By % Overall Passing)

In [61]:
# Sort the schools by `% Overall Passing` in ascending order and display the top 5 rows.
bottom_schools = per_school_summary_df.sort_values("% Passing Both", ascending = True)
bottom_schools.head(5)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
11,Rodriguez High School,District,"3,999","$2,547,363.00",$637.00,%76.84,%80.74,"2,654","3,208","2,119",%66.37,%80.22,%52.99
1,Figueroa High School,District,"2,949","$1,884,411.00",$639.00,%76.71,%81.16,"1,946","2,381","1,569",%65.99,%80.74,%53.20
0,Huang High School,District,"2,917","$1,910,635.00",$655.00,%76.63,%81.18,"1,916","2,372","1,561",%65.68,%81.32,%53.51
3,Hernandez High School,District,"4,635","$3,022,020.00",$652.00,%77.29,%80.93,"3,094","3,748","2,481",%66.75,%80.86,%53.53
12,Johnson High School,District,"4,761","$3,094,650.00",$650.00,%77.07,%80.97,"3,145","3,867","2,549",%66.06,%81.22,%53.54

## Math Scores by Grade

In [62]:
# Use the code provided to separate the data by grade
ninth_graders_df = combined_school_df[(combined_school_df["grade"] == "9th")]
tenth_graders_df = combined_school_df[(combined_school_df["grade"] == "10th")]
eleventh_graders_df = combined_school_df[(combined_school_df["grade"] == "11th")]
twelfth_graders_df = combined_school_df[(combined_school_df["grade"] == "12th")]

In [63]:
# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grade_math_scores_df = ninth_graders_df.groupby(["school_name"])["math_score"].mean()
tenth_grader_math_scores_df = tenth_graders_df.groupby(["school_name"])["math_score"].mean()
eleventh_grader_math_scores_df = eleventh_graders_df.groupby(["school_name"])["math_score"].mean()
twelfth_grader_math_scores_df = twelfth_graders_df.groupby(["school_name"])["math_score"].mean()

In [64]:
# Combine each of the scores above into single DataFrame called `math_scores_by_grade`
math_scores_by_grade_df = pd.DataFrame (ninth_grade_math_scores_df)
math_scores_by_grade_df = math_scores_by_grade_df.rename (columns = {"math_score":"9th"})
math_scores_by_grade_df = pd.merge(math_scores_by_grade_df, tenth_grader_math_scores_df, how="left", on=["school_name"])
math_scores_by_grade_df = math_scores_by_grade_df.rename (columns = {"math_score":"10th"})
math_scores_by_grade_df = pd.merge(math_scores_by_grade_df, eleventh_grader_math_scores_df, how="left", on=["school_name"])
math_scores_by_grade_df = math_scores_by_grade_df.rename (columns = {"math_score":"11th"})
math_scores_by_grade_df = pd.merge(math_scores_by_grade_df, twelfth_grader_math_scores_df, how="left", on=["school_name"])
math_scores_by_grade_df = math_scores_by_grade_df.rename (columns = {"math_score":"12th"})
math_scores_by_grade_df.head(3)

                            9th       10th       11th       12th
school_name
Bailey High School    77.083676  76.996772  77.515588  76.492218
Cabrera High School   83.094697  83.154506  82.765560  83.277487
Figueroa High School  76.403037  76.539974  76.884344  77.151369

In [65]:
math_scores_by_grade_df.index.name = None
math_scores_by_grade_df

                             9th       10th       11th       12th
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

## Reading Scores by Grade

In [66]:
# Use the code provided to separate the data by grade
ninth_graders_df = combined_school_df[(combined_school_df["grade"] == "9th")]
tenth_graders_df = combined_school_df[(combined_school_df["grade"] == "10th")]
eleventh_graders_df = combined_school_df[(combined_school_df["grade"] == "11th")]
twelfth_graders_df = combined_school_df[(combined_school_df["grade"] == "12th")]

In [67]:
# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grader_reading_scores_df = ninth_graders_df.groupby(["school_name"])["reading_score"].mean()
tenth_grader_reading_scores_df = tenth_graders_df.groupby(["school_name"])["reading_score"].mean()
eleventh_grader_reading_scores_df = eleventh_graders_df.groupby(["school_name"])["reading_score"].mean()
twelfth_grader_reading_scores_df = twelfth_graders_df.groupby(["school_name"])["reading_score"].mean()

In [68]:
# Combine each of the scores above into single DataFrame called `math_scores_by_grade`
reading_scores_by_grade_df = pd.DataFrame (ninth_grader_reading_scores_df)
reading_scores_by_grade_df = reading_scores_by_grade_df.rename (columns = {"reading_score":"9th"})
reading_scores_by_grade_df = pd.merge(reading_scores_by_grade_df, tenth_grader_reading_scores_df, how="left", on=["school_name"])
reading_scores_by_grade_df = reading_scores_by_grade_df.rename (columns = {"reading_score":"10th"})
reading_scores_by_grade_df = pd.merge(reading_scores_by_grade_df, eleventh_grader_reading_scores_df, how="left", on=["school_name"])
reading_scores_by_grade_df = reading_scores_by_grade_df.rename (columns = {"reading_score":"11th"})
reading_scores_by_grade_df = pd.merge(reading_scores_by_grade_df, twelfth_grader_reading_scores_df, how="left", on=["school_name"])
reading_scores_by_grade_df = reading_scores_by_grade_df.rename (columns = {"reading_score":"12th"})
reading_scores_by_grade_df.head(3)

                            9th       10th       11th       12th
school_name
Bailey High School    81.303155  80.907183  80.945643  80.912451
Cabrera High School   83.676136  84.253219  83.788382  84.287958
Figueroa High School  81.198598  81.408912  80.640339  81.384863

In [69]:
# Minor data wrangling
reading_scores_by_grade_df.index.name = None
reading_scores_by_grade_df

                             9th       10th       11th       12th
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

## Scores by School Spending

In [115]:
# Establish the bins 
spending_bins = [0, 585, 630, 645, 680]
spending_labels = ["<$585", "$585-630", "$630-645", "$645-680"]

In [116]:
# Create a copy of the school summary since it has the "Per Student Budget" 
school_spending_df = per_school_sum_B4_df.copy()
school_spending_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107

In [117]:
# Use `pd.cut` to categorize spending based on the bins.
school_spending_df["Spending Ranges (Per Student)"] = pd.cut(school_spending_df["Budget Per Student"], spending_bins, labels = spending_labels)
school_spending_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both,Spending Ranges (Per Student)
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884,$645-680
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476,$630-645
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107,$585-630

In [118]:
#  Calculate averages for the desired columns.
spending_math_scores = school_spending_df.groupby(["Spending Ranges (Per Student)"])["Average Math Score"].mean()
spending_reading_scores = school_spending_df.groupby(["Spending Ranges (Per Student)"])["Average Reading Score"].mean()
spending_passing_math = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Math"].mean()
spending_passing_reading = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Reading"].mean()
overall_passing_spending = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Both"].mean()

In [119]:
# Assemble into DataFrame
spending_summary_df = pd.DataFrame(spending_math_scores)
spending_summary_df = pd.merge(spending_summary_df, spending_reading_scores, how="left", on=["Spending Ranges (Per Student)"])
spending_summary_df = pd.merge(spending_summary_df, spending_passing_math, how="left", on=["Spending Ranges (Per Student)"])
spending_summary_df = pd.merge(spending_summary_df, spending_passing_reading, how="left", on=["Spending Ranges (Per Student)"])
spending_summary_df = pd.merge(spending_summary_df, overall_passing_spending, how="left", on=["Spending Ranges (Per Student)"])

# Display results
spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Both
Spending Ranges (Per Student),,,,,
<$585,83.455399,83.933814,93.460096,96.610877,90.369459
$585-630,81.899826,83.155286,87.133538,92.718205,81.418596
$630-645,78.518855,81.624473,73.484209,84.391793,62.857656
$645-680,76.997210,81.027843,66.164813,81.133951,53.526855

## Scores by School Size

In [121]:
# Establish the bins.
size_bins = [0, 1000, 2000, 5000]
size_labels = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

In [122]:
# Create a copy of the school summary 
school_size_df = per_school_sum_B4_df.copy()
school_size_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107

In [123]:
# Categorize the spending based on the bins
# Use `pd.cut` on the "Total Students" column of the `per_school_summary` DataFrame.

school_size_df["School Size"] =pd.cut(school_size_df["Total Students"], size_bins, labels = size_labels)
school_size_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both,School Size
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884,Large (2000-5000)
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476,Large (2000-5000)
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107,Medium (1000-2000)

In [125]:
# Calculate averages for the desired columns. 
size_math_scores = school_size_df.groupby(["School Size"])["Average Math Score"].mean()
size_reading_scores = school_size_df.groupby(["School Size"])["Average Reading Score"].mean()
size_passing_math = school_size_df.groupby(["School Size"])["% Passing Math"].mean()
size_passing_reading = school_size_df.groupby(["School Size"])["% Passing Reading"].mean()
size_overall_passing = school_size_df.groupby(["School Size"])["% Passing Both"].mean()

In [131]:
# Create a DataFrame called `size_summary` that breaks down school performance based on school size (small, medium, or large).
# Use the scores above to create a new DataFrame called `size_summary`
size_summary_df = pd.DataFrame(size_math_scores)
size_summary_df = pd.merge(size_summary_df, size_reading_scores, how="left", on=["School Size"])
size_summary_df = pd.merge(size_summary_df, size_passing_math, how="left", on=["School Size"])
size_summary_df = pd.merge(size_summary_df, size_passing_reading, how="left", on=["School Size"])
size_summary_df = pd.merge(size_summary_df, size_overall_passing, how="left", on=["School Size"])

# Display results
size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Both
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,89.883853
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,90.621535
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,58.286003

## Scores by School Type

In [132]:
# Create a copy of the school summary 
school_type_df = per_school_sum_B4_df.copy()
school_type_df.head(3)

,School Name,School Type,Total Students,School Budget,Budget Per Student,Average Math Score,Average Reading Score,Students Passing Math,Students Passing Reading,Students Passing Both,% Passing Math,% Passing Reading,% Passing Both
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,1561,65.683922,81.316421,53.513884
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,1569,65.988471,80.739234,53.204476
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,1583,93.867121,95.854628,89.892107

In [134]:
# Group the per_school_summary DataFrame by "School Type" and average the results.
average_math_score_by_type = school_type_df.groupby(["School Type"])["Average Math Score"].mean()
average_reading_score_by_type = school_type_df.groupby(["School Type"])["Average Reading Score"].mean()
average_percent_passing_math_by_type = school_type_df.groupby(["School Type"])["% Passing Math"].mean()
average_percent_passing_reading_by_type = school_type_df.groupby(["School Type"])["% Passing Reading"].mean()
average_percent_overall_passing_by_type = school_type_df.groupby(["School Type"])["% Passing Both"].mean()

In [139]:
# Assemble the new data by type into a DataFrame called `type_summary`
type_summary_df = pd.DataFrame(average_math_score_by_type)
type_summary_df = pd.merge(type_summary_df, average_reading_score_by_type, how="left", on=["School Type"])
type_summary_df = pd.merge(type_summary_df, average_percent_passing_math_by_type, how="left", on=["School Type"])
type_summary_df = pd.merge(type_summary_df, average_percent_passing_reading_by_type, how="left", on=["School Type"])
type_summary_df = pd.merge(type_summary_df, average_percent_overall_passing_by_type, how="left", on=["School Type"])

# Display results
type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Both
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208